{"id":1142,"parentExerciseId":1053,"name":"Flowcharts kaise banayein?","slug":"python__if-statement-flowcharts/how-to-make-flowchart","sequenceNum":12001,"reviewType":"peer","solution":null,"content":"```ngMeta\nname: Flowcharts kaise banayein?\n```\n\n# How to Make Flowcharts?\n\nJab bhi hum flowcharts bana rahe hain, hume flowcharts ko paper par banana chaiye. Paper pe flowcharts banana bahot aasan aur saral hota hai. Apne laptop ya computer pe banana utna aasan nahi hota. \n\nLekin jab bhi aapko apne flowcharts ko submit karna hoga, toh aapko ek website [draw.io](http://draw.io) ka use karna hoga.\n\n# Draw.io mein flowchart kaise banana hai?\n\nJaise hi aap [draw.io](http://draw.io) kholenge toh aapko yeh choose karna hoga ki aap apne flowcharts kahan save karo. Iske liye `Device` choose karo. Yeh option choose kar ke aap apne computer mein flowchart ki file download kar paoge.\n\n![Draw.io Opening Screenshot](https://s3.ap-south-1.amazonaws.com/saralng/Basics__of__Programming__using__Python/12006/12001/58ubbn.how-to-make-flowchart_drawio-device-option.png)\n\n1. Fir `Create New Diagram` pe click kare.\n2. Fir apne flowchart ki file ka naam daalein.\n\nLeft side mein flowchart waale section men aapko saare flowchart ke boxes mil jayenge jisse aap flowchart bana sakte ho. Inn boxes ko aap arrows se connect kar sakte ho.\n\n![Draw.io Draw Flowchart Screenshot](https://s3.ap-south-1.amazonaws.com/saralng/Basics__of__Programming__using__Python/12006/12001/73mkt3.how-to-make-flowchart_drawio-draw-flowchart.png)\n\nFinally `File` menu jaake aap iss flowchart ko save kar sakte hain. Isko save karke ek `xml` file download hogi jisko aapne submit karna hai.\n\nAise hi aap ek dusre mein bhi yeh flowchart file ka use kar flowcharts share kar sakte ho. Agar aapne ek flowchart file is flowchart kholna hai toh `File` menu mein jaake `Open From` mein se `Device` option select karke apni file choose kar lena.\n\n**Agle kuch questions mein aapko flowchart bana ke yeh waali files ko submit karna hai. Jab aap draw.io mein flowchart bana rahe ho, toh colors pe dhyaan dene ki zaroorat nahi hai. Humne examples wale flowcharts aapki asani ke liye color kare hain.**","submissionType":null,"githubLink":"https://github.com/navgurukul/newton/tree/master/python/if-statement-flowcharts/how-to-make-flowchart.md"}