{"id":2027,"parentExerciseId":2027,"name":"Introduction to Loops","slug":"loops-101__LoopConditions/introduction","sequenceNum":5000,"reviewType":"peer","solution":null,"content":"```ngMeta\nname: Introduction to Loops\ncompletionMethod: manual\n```\n\n# Understanding Loop Conditions\n\nYeh code dekhte hain\n\n```python\ni = 1\nwhile i < 100:\n  print(i)\n  i = i + 1\n```\n\nYeh code 1 se leke 99 tak numbers ko print kar dega. Lekin agar iss code ko ache se samajhne ke liye har line mein kya ho raha hai woh samajhte hain.\n\n1. `i = 1` yahan pe humne `i` naam ka variable define kiya aur usme `1` value daali.\n2. `while i < 100` yahan humne ek loop define kara. Hindi mein iska matlab hai ki jab tak `i` ki value 100 se kam hai tab tak is while ke andar likha hua kaam karte raho. Toh yeh kaam tab tak hota rahega jab i ki value 100 se kam hai.\n3. `print(i)` waali line loop ke andar likhi hui hai. Toh jab tak i ki value 100 se kam hai tab tak har baar loop chalega toh har baar yeh line chalegi.\n4. `i = i + 1` Yeh waali line humare counter ko badayegi. Ek tareeke se yeh waali line determine karti hai ki humara loop kitni baar chalega.\n\nYahan pe `i = i + 1` aur `while i < 100` sabse important statements mein se hai. Yeh video dekh ke hum samjhenge ki inn lines ka exact matlab kya hai aur computer inko kaise samajhta hai. Isse hum better tareeke se loops likh payenge.\n\n## Contents of Video\n1. What does it mean to write the `i < 100` in the following loop?\n```python\ni = 1\nwhile i <= 10:\n  print(i)\n  i = i + 1\n```\n2. How does the loop run? Every time the code within the loop block is executed the condition is evaluated once again and until the condition is true the loop keeps on running. Basically the condition results into a boolean and if the boolean is True then the loop is run otherwise it is not run.\n3. Apart from this we can also put the statement like this.\n```python\ni = 1\nwhile i != 10:\n  print(i)\n  i = i + 1\n```\n4.\n","submissionType":null,"githubLink":"https://github.com/navgurukul/newton/tree/master/loops-101/LoopConditions/introduction.md"}